In [2]:
import pandas as pd
import numpy as  np
from pandas import Series,DataFrame
from numpy import reshape

数据导入
pd.read_csv(filename)：从CSV文件导入数据
pd.read_table(filename)：从限定分隔符的文本文件导入数据
pd.read_excel(filename)：从Excel文件导入数据
pd.read_sql(query, connection_object)：从SQL表/库导入数据
pd.read_json(json_string)：从JSON格式的字符串导入数据
pd.read_html(url)：解析URL、字符串或者HTML文件
pd.read_clipboard()：从粘贴板获取内容
pd.DataFrame(dict)：从字典对象导入数据

数据导出
df.to_csv(filename)：导出数据到CSV文件
df.to_excel(filename)：导出数据到Excel文件
df.to_sql(table_name, connection_object)：导出数据到SQL表
df.to_json(filename)：以Json格式导出数据到文本文件

创建对象
pd.DataFrame(np.random.rand(20,5))：创建20行5列的随机数组成的DataFrame对象
pd.Series(my_list)：从可迭代对象my_list创建一个Series对象
df.index = pd.date_range('1900/1/30', periods=df.shape[0])：增加一个日期索引
index和reindex联合使用很有用处，index可作为索引并且元素乱排序之后，所以跟着元素保持不变，因此，当重拍元素时，只需要对index进行才重排即可:reindex。另外， reindex时，还可以增加新的标为NaN的元素。


数据查看
df.head(n)：查看DataFrame对象的前n行
df.tail(n)：查看DataFrame对象的最后n行
df.shape()：查看行数和列数
df.info()：查看索引、数据类型和内存信息
df.describe()：查看数值型列的汇总统计
s.value_counts(dropna=False)：查看Series对象的唯一值和计数
df.apply(pd.Series.value_counts)：查看DataFrame对象中每一列的唯一值和计数
apply的用处很多，比如可以通过跟lambda函数联合，完成很多功能：将包含某个部分的元素挑出来等等。
cities['Is wide and has saint name'] = (cities['Area square miles'] > 50) & cities['City name'].apply(lambda name: name.startswith('San'))

 
数据选取
df[col]：根据列名，并以Series的形式返回列
df[[col1, col2]]：以DataFrame形式返回多列
s.iloc[0]：按位置选取数据
s.loc['index_one']：按索引选取数据
df.iloc[0,:]：返回第一行

数据清洗
df.columns = ['a','b','c']：重命名列名
pd.isnull()：检查DataFrame对象中的空值，并返回一个Boolean数组
pd.notnull()：检查DataFrame对象中的非空值，并返回一个Boolean数组
df.dropna()：删除所有包含空值的行
df.fillna(x)：用x替换DataFrame对象中所有的空值
s.astype(float)：将Series中的数据类型更改为float类型
s.replace(1,'one')：用‘one’代替所有等于1的值
df.rename(columns=lambda x: x + 1)：批量更改列名
df.set_index('column_one')：更改索引列

数据处理：Filter, Sort, GroupBy
df[df[col] > 0.5]：选择col列的值大于0.5的行
df.sort_values(col1)：按照列col1排序数据，默认升序排列
df.groupby(col)：返回一个按列col进行分组的Groupby对象
df.groupby(col1).agg(np.mean)：返回按列col1分组的所有列的均值
df.pivot_table(index=col1, values=[col2,col3], aggfunc=max)：创建一个按列col1进行分组，并计算col2和col3的最大值的数据透视表
data.apply(np.mean)：对DataFrame中的每一列应用函数np.mean

数据合并
df1.append(df2)：将df2中的行添加到df1的尾部
df.concat([df1, df2],axis=1)：将df2中的列添加到df1的尾部
df1.join(df2,on=col1,how='inner')：对df1的列和df2的列执行SQL形式的join

数据统计
df.describe()：查看数据值列的汇总统计
df.mean()：返回所有列的均值
df.corr()：返回列与列之间的相关系数
df.count()：返回每一列中的非空值的个数
df.max()：返回每一列的最大值
df.min()：返回每一列的最小值
df.median()：返回每一列的中位数
df.std()：返回每一列的标准差

Pandas支持的数据类型
int 整型
float 浮点型
bool 布尔类型
object 字符串类型
category 种类
datetime 时间类型

补充：
df.astypes: 数据格式转换
df.value_counts:相同数值的个数统计
df.hist(): 画直方图
df.get_dummies: one-hot编码，将类型格式的属性转换成矩阵型的属性。比如：三种颜色RGB，红色编码为[1 0 0]

参考文章：

Pandas官网https://pandas.pydata.org/

Pandas官方文档https://pandas.pydata.org/pandas-docs/stable/index.html

Pandas Cheat Sheet -- Python for Data Science  https://www.dataquest.io/blog/pandas-cheat-sheet/

10 minutes to Pandas  https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

pandas中文网站:https://www.pypandas.cn/docs/getting_started/basics.html#head-%E4%B8%8E-tail

# 两个主要数据结构：Series和DataFrame
+ ***Series***:类似于一维数组，由一组数据和与数据索引组成
+ ***DataFrame***：是一个表格型的数据结构，每列可以是不同的值类型（数值，字符串，布尔值等），既有行索引也有列索引，被看做由Series组成的字典（共用同一个索引），类似于Excel表格。
+ 学习链接 https://www.jianshu.com/p/d9774cf1fea5

# Series基本构建方法

In [3]:
obj=Series([4,7,-5,3]) #构建Series，名称为obj,将自动创建0——>N-1的整数型索引

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values#查询Series-obj的值

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index#查询Series-obj的索引

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj.dtype #查询数据类型

dtype('int64')

In [8]:
#修改索引：可以通过赋值的方式就地修改,通过改变索引内容直接赋值。
obj.index=['Bob','Steve','Jeff','Ryan']  #原来索引是[1,2,3,4]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [9]:
obj2=Series([4,7,-5,3],index=['d','b','a','c'])#手动添加index索引
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index#查询Series-obj2的索引

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2['a'],obj2['d'] #可以通过索引的方式选取Series中的单个或一组值

(-5, 4)

In [12]:
obj2['d']=9  #将obj index索引为d的数值变更为8
obj2['d']

9

In [13]:
#Numpy数组运算（布尔值数组过滤，标量乘法，应用数学函数等）都会保留索引和值之间的链接：
obj2[obj2>2]

d    9
b    7
c    3
dtype: int64

In [14]:
obj2*2

d    18
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)# np.exp(B) 求e的幂次方;np.sqrt(B):求B的开方

d    8103.083928
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
#可以将Series看成一个定长的有序字典，因为他是索引值到数据值的一个映射。它可以用在许多原本需要字典参数的函数中
'b' in obj2,'f' in obj2 #b是存在的索引则true，而f是不存在的索引则false,只能通过索引取值

(True, False)

In [17]:
#可以通过python字典来构建Series:
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3=Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
state=['California','Ohio','Oregon','Texas']
obj4=Series(sdata,index=state) #在index 指定为states时，需要到sdata数组中去匹配相对应的值,注意区分大小写）
obj4  #output：'California'不在sdata中，其结果为NaN(非数字not a number，缺失值missing，NA值）

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
obj4.dtype #查询数据类型

dtype('float64')

# pandas中isnull和notnull函数用于简称缺失数据
+ isnull：缺失值为True，非缺失值为False
+ notnull：缺失值为False，非缺失值为True

In [20]:

pd.isnull(obj4)#isnull：缺失值为True，非缺失值为False

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)# notnull：缺失值为False，非缺失值为True

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
#Series也有类似的实例方法
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
#Series最重要的一个功能：算术运算中会自动对其不同索引的数据：两个数组相加时，会根据索引相同的值相加，例如Ohio洲的两个数组值相加）
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
#给Series数组及其index索引赋予一个名字name
obj4.name='population'
obj4.index.name='state'
obj4  #output:最下方Name: population

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj4.index  #output:最右方name='state'

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object', name='state')

In [27]:
obj4['Ohio']  #根据索引取值

35000.0

# DataFrame基本构建方法

In [43]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data) #不指定列排序，则自动按data字典顺序
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [44]:
frame=DataFrame(data,columns=['year','state','pop'])

In [45]:
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [46]:
#类似于Series,传入的数据中找不到，就会产生NA值（output中是NaN表示)
frame2=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five']) #显式指定列顺序和索引
frame2    #debt 为NaN

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [47]:
#取列：可以将DataFrame的列获取为Series数组，拥有原来相同的索引且各Series的name属性也自动定义好了，例如name=state,name=year。
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

### df.col.isin([]) 按条件过滤

In [48]:
frame2[frame2.year.isin ([2000,2001])]

      year   state  pop debt
one   2000    Ohio  1.5  NaN
two   2001    Ohio  1.7  NaN
four  2001  Nevada  2.4  NaN

In [49]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [50]:
frame2['year']  #等同于frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [51]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [52]:
#取行，用索引字段方法loc,可以将DataFrame的行获取为Series数组，通过位置或名称的方式进行获取
frame2.loc['three']  #use index

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [53]:
#列可以通过赋值的方式进行修改,列表或数组长度必须匹配,所有的空位都将被填上缺失值
frame2['debt']=16.5#debt=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [54]:
frame2['debt']=np.arange(5) #长度5，整数0-4
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [55]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2  #one,three自动填充为NaN

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [56]:
#删除列,关键字del
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [57]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [88]:
#另一种数据形式的嵌套字典（也就是字典的字典）
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3=DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [89]:
frame3.T#行列转置

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [90]:
#2000索引未被指定则合并删除，2003索引新增但无值则NaN
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [91]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [92]:
frame3['Ohio'][:-1]  #取Ohio列的值,倒数第一个的索引是-1

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [93]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [94]:
#给index和columns属性命名
frame3.index.name='year'
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [95]:
frame3.index #取出索引值

Int64Index([2001, 2002, 2000], dtype='int64', name='year')

In [96]:
frame3.values#取值列值

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [97]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

### df.col.astype() #str,int,float用法

In [101]:
frame3.Ohio=frame3.Ohio.astype(str)#type是object
frame3.Ohio.dtype,frame3

(dtype('O'),
 state  Nevada Ohio
 year
 2001      2.4  1.0
 2002      2.9  3.0
 2000      NaN  1.0)

# reindex方法：重建索引，根据索引重排，某个索引不存在则引入缺失值NaN

# reindex函数的参数
+ ***index***,用作索引的新序列  
+ ***method*** 补充缺失值的方法ffill,bfill  
+ ***fill_value*** 重新索引过程中，缺失值的替代值  
+ ***level*** 在Multiindex的指定级别上匹配简单索引，否则选取其子集  
+ ***copy*** 默认为True,无论如何都复制，如果为False,新旧相等不复制

In [56]:
obj=Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [129]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [130]:
obj2=obj.reindex(['a','b','c','d','e'])

In [59]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [131]:
#fill_value=0将缺失值填充为0
obj.reindex(['a','b','c','d','e'],fill_value=0)

a    0.0
b    1.0
c    2.0
d    3.0
e    0.0
dtype: float64

# method方法：重新索引插值处理,ffill取前值搬运填充，bfill取后值搬运填充

In [61]:
obj3=Series(['blue','purple','yellow'],index=[0,2,4])

In [62]:
obj3.reindex(range(6),method='ffill')  #取前值填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [63]:
obj3.reindex(range(6),method='bfill')#取后值填充，或backfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [64]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [65]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [137]:
frame2['Ohio'] #取出Ohio列

a    0.0
b    NaN
c    3.0
d    6.0
Name: Ohio, dtype: float64

In [67]:
states=['Utah','California','Texas']

In [68]:
frame.reindex(columns=states) #使用columns关键字（列标）可重新索引

   Utah  California  Texas
a   NaN           2      1
c   NaN           5      4
d   NaN           8      7

In [ ]:
#同时对行和列进行重新索引，而插值则只能按行应用,ffill()取前值填充
frame.reindex(index=['a','b','c','d'],columns=states).ffill()

In [99]:
frame.ix[['a','c','d']]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [178]:
obj=Series(np.arange(5.),index=['a','b','c','d','e'])

# drop按指定的索引清除数据，删除行或列;drop不影响源数据

In [105]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [103]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [104]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [108]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data.drop(['Colorado','Ohio']) #drop不影响源DataFrame

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [279]:
data.drop('two',axis=1) #代表按列columns处理

          one  three  four
Ohio        0      0     0
Colorado    0      6     7
Utah        8     10    11
New York   12     14    15

In [280]:
data.drop(['two','four'],axis=1)#代表按列columns处理

          one  three
Ohio        0      0
Colorado    0      6
Utah        8     10
New York   12     14

# drop_duplicates 删除重复值

In [145]:
??drop_duplicates

Object `drop_duplicates` not found.

# 索引，选取和过滤  
1.利用标签切片运算与普通python运算不同，其末端是包含的。  
2.DataFrame进行索引：通过列名columns取列值，根据行号[0:n]取行值,或用ix取行值  
3.索引字段ix或loc或iloc,可选取行和列的子集

# DataFrame的索引选项  
+ ***obj[val]***:选取DataFrame单个列或一组列，布尔型过滤，行切片，布尔型设置值等  
+ ***obj.ix[val]***：选取DataFrame单个行或一组行  
+ ***obj.ix[:,val]***:选取单个列或列子集  
+ ***obj.ix[val1,val2]***:同时选取行和列  
+ ***reindex***:重建索引  
+ ***xs***方法：根据标签选取单行或单列，并返回一个Series  
+ ***icol，irow***方法：根据整数位置选取单列或单行，并返回一个Series  
+ ***get_value、set_value***方法：根据行标签和列标签选取单个值

In [118]:
obj=Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [119]:
obj['b']

1.0

In [122]:
obj[0] #取第1项

0.0

In [123]:
obj[2:4] #取第3到4项

c    2.0
d    3.0
dtype: float64

In [125]:
obj[['b','a','d']] #取b,a,d项,并按此顺序

b    1.0
a    0.0
d    3.0
dtype: float64

In [126]:
obj[[1,3]] #取1，3项

b    1.0
d    3.0
dtype: float64

In [127]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [134]:
obj['b','c']=5 #将b,c项设置为5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [318]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [140]:
data['two'] #取列值

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [150]:
data[:3] #取行值

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [143]:
data[data['three']>5] #切片通过布尔型数组选取行

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data<5#切片通过布尔型数组选取行

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [149]:
data[data<5]=0 #将data<5的值设置为0

In [148]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [160]:
data.ix[['Colorado','Utah'],[3,0,1]]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [169]:
data.ix[data.three>5,:3]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [172]:
data['three']

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [173]:
data.three

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [179]:
data.ix['Colorado']

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

# 算术运算和数据对齐  
+ ***add*** 用于加法（+）的方法
+ ***sub*** 用于加法（-）的方法
+ ***div*** 用于加法（/）的方法
+ ***mul*** 用于加法（*）的方法

In [186]:
s1=Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [188]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [189]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [202]:
#算术运算：s1，s2会根据索引自动对齐数据(重叠所隐藏参与计算），不重叠的索引处列为缺失值NaN
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [197]:
df1=DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [198]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [199]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [200]:
df1+df2 #对齐操作同时发生在行index和列columns上

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [203]:
df1=DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df2=DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [204]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [205]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [206]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [212]:
#将df2的值传给df1,如果索引缺失，则该行/列填充0
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [213]:
#df1重建列，取用df2的列名，不存在则该列填充为0
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

# DataFrame和Series之间的运算

In [220]:
arr=np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [221]:
arr[0]

array([0., 1., 2., 3.])

In [222]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [224]:
frame=DataFrame(np.arange(12.).reshape((4,3)),index=['Ohio','Colorado','Utah','New York'],columns=list('bde'))
frame

            b     d     e
Ohio      0.0   1.0   2.0
Colorado  3.0   4.0   5.0
Utah      6.0   7.0   8.0
New York  9.0  10.0  11.0

In [225]:
series=frame.ix[0]
series

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Ohio, dtype: float64

In [226]:
frame-series

            b    d    e
Ohio      0.0  0.0  0.0
Colorado  3.0  3.0  3.0
Utah      6.0  6.0  6.0
New York  9.0  9.0  9.0

In [229]:
series2=Series(range(3),index=list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [230]:
frame+series2

            b   d     e   f
Ohio      0.0 NaN   3.0 NaN
Colorado  3.0 NaN   6.0 NaN
Utah      6.0 NaN   9.0 NaN
New York  9.0 NaN  12.0 NaN

In [233]:
series3=frame['d']
series3

Ohio         1.0
Colorado     4.0
Utah         7.0
New York    10.0
Name: d, dtype: float64

In [234]:
frame

            b     d     e
Ohio      0.0   1.0   2.0
Colorado  3.0   4.0   5.0
Utah      6.0   7.0   8.0
New York  9.0  10.0  11.0

In [235]:
frame.sub(series3,axis=0)#sub是减

            b    d    e
Ohio     -1.0  0.0  1.0
Colorado -1.0  0.0  1.0
Utah     -1.0  0.0  1.0
New York -1.0  0.0  1.0

# 函数应用和映射
+ apply方法，应用函数

In [103]:
frame=DataFrame(np.random.randn(4,3).reshape((4,3)),index=['Ohio','Colorado','Utah','New York'],columns=list('bde'))
frame

                 b         d         e
Ohio      0.876950 -0.467114 -0.229079
Colorado -0.093355 -0.646505 -0.069171
Utah     -0.305029 -0.055010  0.023187
New York -0.499877  1.868043 -0.362833

In [104]:
np.abs(frame) #abs取绝对值

                 b         d         e
Ohio      0.876950  0.467114  0.229079
Colorado  0.093355  0.646505  0.069171
Utah      0.305029  0.055010  0.023187
New York  0.499877  1.868043  0.362833

In [105]:
#lambda匿名函数f，功能简单，有输入x,输出x.max()-x.min() 
f=lambda x:x.max()-x.min()

In [106]:
frame.apply(f)#默认应用在列上，取该列值参与计算

b    1.376827
d    2.514548
e    0.386021
dtype: float64

In [107]:
#apply方法：函数应用
frame.apply(f,axis=1) #应用在行上，取该行值参与计算

Ohio        1.344064
Colorado    0.577334
Utah        0.328216
New York    2.367920
dtype: float64

In [108]:
def f(x): #定义函数f
    return Series([x.min(),x.max()],index=['min','max'])

In [109]:
frame.apply(f)

            b         d         e
min -0.499877 -0.646505 -0.362833
max  0.876950  1.868043  0.023187

In [110]:
fromat=lambda x: '%.2f'%x

In [111]:
frame

                 b         d         e
Ohio      0.876950 -0.467114 -0.229079
Colorado -0.093355 -0.646505 -0.069171
Utah     -0.305029 -0.055010  0.023187
New York -0.499877  1.868043 -0.362833

In [112]:
frame.applymap(fromat)#作用在df的每个元素上

              b      d      e
Ohio       0.88  -0.47  -0.23
Colorado  -0.09  -0.65  -0.07
Utah      -0.31  -0.06   0.02
New York  -0.50   1.87  -0.36

In [113]:
frame['e'].map(fromat) #作用在指定列名上

Ohio        -0.23
Colorado    -0.07
Utah         0.02
New York    -0.36
Name: e, dtype: object

In [116]:
frame['e'].apply(fromat)

Ohio        -0.23
Colorado    -0.07
Utah         0.02
New York    -0.36
Name: e, dtype: object

In [119]:
frame.loc['Ohio'].apply(fromat) #作用在指定行上，loc是按索引名称或索引号来取值

b     0.88
d    -0.47
e    -0.23
Name: Ohio, dtype: object

# 排序 sort_index,sort_values
+ ***sort_index***方法：***按行和列索引***进行排序（按字典顺序）,obj.sort_index()
+ ***sort_values***方法：***按值***进行排序obj.sort_values()
+ DataFrame按列值排序：obj.sort_values(***by***=columnsname) 
+ DataFrame按行值排序：obj.sort_values(axis=1,***by***=indexname)；***axis=1***代表按行排序
+ ***ascending***=False是降序

In [284]:
obj=Series(range(4),index=['d','a','b','c'])

In [308]:
obj.sort_values() #按变量值排序

d    0
a    1
b    2
c    3
dtype: int64

In [309]:
obj.sort_values(ascending=False) #按变量值降序

c    3
b    2
a    1
d    0
dtype: int64

In [285]:
obj.sort_index() #按索引a,b,c,d顺序排

a    1
b    2
c    3
d    0
dtype: int64

In [296]:
#行与列索引都可以用list，这样操作简化
frame2=DataFrame(np.arange(8).reshape((2,4)),index=list('12'),columns=list('bdca'))

In [297]:
frame2

   b  d  c  a
1  0  1  2  3
2  4  5  6  7

In [321]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [305]:
frame.sort_index()#按行名排序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [301]:
frame.sort_index(axis=1) #按列名排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [329]:
frame.sort_index(axis=1,ascending=False)#ascending=False降序排序

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [314]:
frame.sort_values(by='c') #指定某列排序

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [319]:
frame.sort_values(by=['c','b']) #指定两列或多列排序

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [317]:
frame.sort_values(axis=1,by='one') #指定某行排序

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [320]:
frame.sort_values(axis=1,by=['one','three']) #指定两行或多行排序

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

# 排名rank  
+ 跟排序关系密切，会增设一个排名值，用于显示排名（从1开始），method方法将破坏平级关系
+ 升序 排名越靠前数字越大，和日常理解相反

In [324]:
obj=Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [325]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [330]:
obj.rank(method='first')#按原数据出现的顺序

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [328]:
obj.rank(ascending=False,method='max') #按降序排名，method破坏平级关系

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [332]:
frame.rank(axis=1) #按行值排名

         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

In [333]:
frame.rank() #按列值排名

         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0

In [29]:
obj=Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [30]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

# unique
+ 对于一维数组或者列表，unique函数去除其中重复的元素，并按元素由大到小返回一个新的无元素重复的元组或者列表

In [31]:

c=['astra','ama','test']

In [32]:
cc=np.unique(c,return_index=True)#return_index=True表示返回新列表元素在旧列表中的位置
cc

(array(['ama', 'astra', 'test'], dtype='<U5'), array([1, 0, 2], dtype=int64))

# len()
Python len() 方法返回对象（字符、列表、元组等）长度或项目个数。

In [33]:
str = "runoob"
len(str)

6

In [120]:
obj=Series([7,-5,7,4,2,0,4])
len(obj)

7

In [121]:
frame=DataFrame(np.random.randn(4,3).reshape((4,3)),index=['Ohio','Colorado','Utah','New York'],columns=list('bde'))
frame

                 b         d         e
Ohio      0.212808  0.958047 -0.228949
Colorado  0.854482 -0.535038 -0.385994
Utah      1.001123  1.846111 -0.219692
New York -0.775034 -0.066036  0.944777

In [122]:
len(frame)

4

In [127]:
frame.columns

Index(['b', 'd', 'e'], dtype='object')

# shape，count,describe等
+ 查看df和series的大小

In [123]:
frame.shape

(4, 3)

In [128]:
obj.shape

(7,)

In [132]:
frame.describe

<bound method NDFrame.describe of                  b         d         e
Ohio      0.212808  0.958047 -0.228949
Colorado  0.854482 -0.535038 -0.385994
Utah      1.001123  1.846111 -0.219692
New York -0.775034 -0.066036  0.944777>

In [135]:
frame.count() #按列计算

b    4
d    4
e    4
dtype: int64

In [134]:
frame.count(axis=1)#按行计算

Ohio        3
Colorado    3
Utah        3
New York    3
dtype: int64